## 📅 날짜: 2025-02-04

### 💬 스크럼
- 학습 목표 1 : 패킷 트레이서 사용법 이해하기
- 학습 목표 2 : 패킷 트레이서로 간단한 네트워크 구성해보기

### 📒 새로 배운 내용
#### 주제 1 : **VLAN**
  > IP 대역을 두 대역으로 나누고 싶으면 다른 대역으로 세팅된 두 대의 스위치를 사용하면 된다. <br>
  그럼 대역을 늘리고 싶을 때마다 스위치를 추가? → 비용이 많이 든다. <br>
  VLAN 사용 시 스위치 한 대로 가능하며 VLAN 그룹끼리만 브로드캐스트를 주고 받아 불필요한 트래픽이 감소한다.
- vlan id <br>
  1 : default, 모든 포트가 여기 소속됨 <br>
  1002 ~ 1005 : FDDI, 토큰링 등으로 고정 <br>
  2 ~ 1001 : 새로운 VLAN 할당
- VLAN 설정
  ```
  Switch> enable                     # 관리자 모드로 진입
  Switch# configuration terminal     # 글로벌 모드 진입
  Switch(config)# vlan 2             # VLAN 모드 진입
  Switch(config-van)# name VLAN_2    # VLAN 이름 설정
  Switch(config-van)# exit
  Switch(config)# exit
  Switch# exit
  ```
- Switch 포트에 VLAN 지정
  ```
  # FastEthernet0/1에 VLAN 2 할당
  Switch> enable                                # 관리자 모드로 진입
  Switch# configuration terminal                # 글로벌 모드 진입
  Switch(config)# interface fa0/1               # 인터페이스 모드 진입
  Switch(config-if)# switchport mode access     # 해당 포트를 VLAN 전용으로 사용함을 선언. access는 VLAN 전용 포트 의미
  Switch(config-if)# switchport access vlan 2   # 해당 포트가 속한 VLAN 번호 설정
  Switch(config-if)# exit
  Switch(config)# exit
  Switch# exit

  # Switch 포트 설정 확인
  Switch# show vlan
  ```
- 동일 VLAN 간 통신 가능, 다른 VLAN 간 통신 불가능

#### 주제 2 : **Trunk**
> 반드시 VLAN을 분리하여 네트워크를 구성해야 한다. <br> 
VLAN을 많이 나눌수록 보안은 향상되지만 Switch의 포트가 낭비된다는 문제가 발생한다. → Trunk 사용
- 하나의 포트에 다수의 VLAN이 지나갈 수 있도록 기능하는 링크 구성
- Trunk 설정
  - Switch0 ↔ Switch1 회선 1개로 설정, Switch0 fa0/5, Switch1 fa0/3의 access 모드를 trunk로 설정
    ```
    Switch> enable
    Switch# config terminal
    Switch(config)# interface fa0/5
    Switch(config-if)# switchport mode trunk

    Switch# show interface trunk
    ```

#### 주제 3 : **Inter VLAN**
> VLAN 간의 통신은 라우터(게이트웨이)를 추가하여 진행 <br>
라우터를 경유하여 다른 LAN으로 통신하는 것처럼
- Router 추가 및 인터페이스 설정
  ```
  Router> enable
  Router# config terminal
  Router(config)# interface fa0/0
  Router(config-if)# no shutdown
  Router(config)# interface fa0/0.2
  Router(config-subif)# encapsulation dot1Q 2
  Router(config-subif)# ip address 203.237.20.254 255.255.255.0
  Router(config)# interface fa0/0.3
  Router(config-subif)# encapsulation dot1Q 3
  Router(config-subif)# ip address 203.237.30.254 255.255.255.0
  ```
- Switch 인터페이스 설정
  ```
  Switch(config)# interface fa0/4
  Switch(config-if)# switchport mode trunk
  ```
- 게이트웨이 설정 <br>
  VLAN 별로 같은 게이트웨이 설정
- 다른 VLAN끼리 통신이 가능해짐

### 🔥 오늘의 도전 과제와 해결 방법
- 도전 과제 : 없음

### 💭 오늘의 회고
- Liked
  - 복습 강의에 잘 집중하였다.
- Learned
  - 패킷 트레이서 사용 방법에 대해 알았다.
  - VLAN, Trunk의 개념을 잘 이해하였다.
- Lacked
  - 없다.
- Longed for
  - GNS3에 대해 알아볼 예정이다.

### 📁 참고 자료 및 링크
- [Trunk 활용 실습](https://tech-network.tistory.com/entry/Trunk%EC%9D%98-%ED%99%9C%EC%9A%A9-%EC%8B%A4%EC%8A%B5-%ED%8C%A8%ED%82%B7%ED%8A%B8%EB%A0%88%EC%9D%B4%EC%84%9C-%EC%9D%B4%EC%9A%A9)
